AcRxFacetProvider.getFacets(AcRxObject!System.Runtime.CompilerServices.IsConst*,AcRxMemberQueryContext!System.Runtime.CompilerServices.IsConst*,AcArray&lt;AcRxClass!System.Runtime.CompilerServices.IsConst**,AcArrayMemCopyReallocator&lt;AcRxClass!System.Runtime.CompilerServices.IsConst**&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
This method is called by AcRxMemberQueryEngine everytime AcRxMemberQueryEngine::newMemberIterator
is called. The derived class can add the facets that supply additional
members in a given context, to the passed collection.
pO:
Input object, which is queried for its members.
pContext:
Input query context object.
facets:
Reference to the facet collection. The class can add facets that
supply additonal members.

AcRxFacetProvider
Abstract base class for all facet providers. The class provides a mechanism
to supply additional members for a given class in a given context. The
derived class can register as a facet provider using AcRxMemberQueryEngine
engine. The engine will call getFacets with the object whose members are
being queried, along with the context. The class can add the facet objects
that supply the additional members to the facet collection that is passed.